/*
//TODO ID не возвращает от сервера APP при Exec     
//TODO Ошибка Сервер приложений падает, если он был перезапущен и к нему клиент отправил заарос.
//TODO Форма редактирования справочника
//TODO сделать удаление сессии на сервере приложения   
//TODO В компонентах textbox и combobox сделать допустимые/недопустимые значения. min и max, список допустимых и недопустиых.
//TODO для компонента datetime допустимые например только рабочие дни.
//TODO выбор даты в виде раскрывающегося дерева: дата + месяц + год и наоборот год + месяц + дата.
//TODO Если сворачиваетися форма сворачивать и форму поиска.                                                                                   
//TODO Рисование и вывод инфы на бэкграунд MainForm.
//TODO история полученныъх сообщений от сервера
//TODO обработка ошиборк вызова запроса если сервер приложений упал.
//TODO Справочник ФЛ, ЮЛ, ИП и др.
//TODO Статусы доделать. Может быть ситуация, когда для разных объектов одной сущности статусная модель разная Например в зависимости от значений атрибута объекта.
//TODO Вызов и создание вебсервисов
//TODO в парсере update, delete, insert.
//TODO средства интеграции что-то универсальное.
//TODO карточка по ссылке в таблице, а также справочник по ссылке в таблице.
//TODO средства интеграции с сайтом. внешний API.
//TODO справка по программме
//TODO средства переноса функционала с одной БД на другую.
//TODO дубли по нескольким полям при загрузке.
//TODO Права на перевод статусов (из определённых статусов в определённые)
//TODO Дедубликация
//TODO Sheduler работа по рассписанию. библиотека Quartz
//TODO Справка для пользователей.
//TODO Сделать фнкционал загрузки бордеро. Ниже описание как это сделать. Описание в FormImport.
//TODO Сделать кнопки вверх-вних навигации по ошибкам на форме SM()
//TODO Возможности открывать на редактирование карточку из данной карточки, и далее следующую карточку, а сохранять все скопом. 
       Предусмотреть возможность сохранения новых таблиц, а не только отдельных значений.
//TODO Ошибка при проверке версии файлов при скачивании из БД     
//TODO Сделать проект публичным на хабре.
*/